conf/src/Documents/ЭП_ПеремещениеНоменклатуры/ЭП_ПеремещениеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ПеремещениеНоменклатуры</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_КачествоНоменклатуры/ЭП_КачествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КачествоНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КачествоНоменклатуры</name>
    <type>
      <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Documents/ЭП_ПеремещениеНоменклатуры/Forms/ФормаПодбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Склад = Параметры.Склад;
	НоменклатураВыбранная = Параметры.НоменклатураВыбор;
	
	МассивИнвентарныйНомер = Новый Массив;
	
	Для Каждого СтрТЗ ИЗ НоменклатураВыбранная Цикл 
		МассивИнвентарныйНомер.Добавить(СтрТЗ.ИнвентарныйНомер);
	КонецЦикла; 
	
	Если МассивИнвентарныйНомер.Количество() <> 0 Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ОстаткиНаСкладеОстатки.Склад = &Склад
		|	И ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
		|	И НЕ ОстаткиНаСкладеОстатки.ИнвентарныйНомер В (&ИнвентарныйНомер)";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ИнвентарныйНомер", МассивИнвентарныйНомер);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Номенкклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			НовСтр = НоменклатураСкладОтправитель.Добавить();
			НовСтр.НоменклатураОтправитель = Номенкклатура;
			НовСтр.НоменклатураОтправительИнвентарник = ИнвентарныйНомер; 
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенкклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			
		КонецЦикла; 
		
	Иначе 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ОстаткиНаСкладеОстатки.Склад = &Склад
		|	И ОстаткиНаСкладеОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			Номенкклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			НовСтр = НоменклатураСкладОтправитель.Добавить();
			НовСтр.НоменклатураОтправитель = Номенкклатура;
			НовСтр.НоменклатураОтправительИнвентарник = ИнвентарныйНомер; 
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенкклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийТаблицыНоменклатураСкладОтправитель

&НаКлиенте
Процедура НоменклатураСкладОтправительВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураСкладОтправитель.ТекущиеДанные; 
	НайденныеСтроки = НоменклатураСкладПолучатель.НайтиСтроки(Новый Структура("ИнвентарныйНомер", СтрокаВыбора.НоменклатураОтправительИнвентарник)); 
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Строка = НоменклатураСкладПолучатель.Добавить();
		Строка.Номенклатура = СтрокаВыбора.НоменклатураОтправитель;
		Строка.ИнвентарныйНомер = СтрокаВыбора.НоменклатураОтправительИнвентарник;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
		
		Для Каждого Строка Из НоменклатураСкладПолучатель Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.НоменклатураОтправительИнвентарник Тогда 
				НоменклатураСкладОтправитель.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыНоменклатураСкладПолучатель 

&НаКлиенте
Процедура НоменклатураСкладПолучательВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураСкладПолучатель.ТекущиеДанные; 
	НайденныеСтроки = НоменклатураСкладОтправитель.НайтиСтроки(Новый Структура("НоменклатураОтправительИнвентарник", СтрокаВыбора.ИнвентарныйНомер));
	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Строка = НоменклатураСкладОтправитель.Добавить();
		Строка.НоменклатураОтправитель= СтрокаВыбора.Номенклатура;
		Строка.НоменклатураОтправительИнвентарник= СтрокаВыбора.ИнвентарныйНомер;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
			
		Для Каждого Строка Из НоменклатураСкладОтправитель Цикл
			Если Строка.НоменклатураОтправительИнвентарник = СтрокаВыбора.ИнвентарныйНомер Тогда 
				НоменклатураСкладПолучатель.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла; 		
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда) 
	
	Адрес = ПоместитьТоварыИзПодбораВоВременноеХранилище();
	ОповеститьОВыборе(Адрес); 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьТоварыИзПодбораВоВременноеХранилище()   
	
	Возврат ПоместитьВоВременноеХранилище(НоменклатураСкладПолучатель.Выгрузить()); 
	
КонецФункции

#КонецОбласти  

#Область АвтоматическоеЗаполнениеПоляКачествоНоменклатуры
 
 &НаСервере
Функция ПолучитьКачествоНоменклатуры(Номенклатура, ИнвентарныйНомер)   
	 Отбор = Новый Структура("Номенклатура, ИнвентарныйНомер", Номенклатура, ИнвентарныйНомер);
	 Возврат РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор).КачествоНоменклатуры;
КонецФункции

&НаКлиенте
Процедура УстановитьКачествоНоменклатурыДляОтправителя()
	СтрокаНоменклатуры = Элементы.НоменклатураСкладОтправитель.ТекущиеДанные; 
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураОтправитель) И ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураОтправительИнвентарник) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.НоменклатураОтправитель, СтрокаНоменклатуры.НоменклатураОтправительИнвентарник);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьКачествоНоменклатурыДляПолучателя()
	СтрокаНоменклатуры = Элементы.НоменклатураСкладПолучатель.ТекущиеДанные; 
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) И ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомер) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.ИнвентарныйНомер);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСкладОтправительНоменклатураОтправительПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляОтправителя();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСкладОтправительНоменклатураОтправительИнвентарникПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляОтправителя();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСкладПолучательНоменклатураПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСкладПолучательИнвентарныйНомерПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляПолучателя();
КонецПроцедуры

#КонецОбласти
